// ex-1: Напишите функцию, которая принимает целое число минут и преобразует его в секунды

// function minToSec(minutes){
//     return minutes * 60;
// }

// console.log(minToSec(5));

// ==========================================================================
// ex-2 Напишите функцию, которая принимает строку в качестве аргумента и
// возвращает ее в обратном порядке. Ex: Hello -> olleH

// function reverseWord(str) {
//   return str.split("").reverse().join("");
// }
// console.log(reverseWord("Hello"));

// ==========================================================================
// ex-3 Напишите функцию, которая принимает число в качестве аргумента и
// возвращает его в обратном порядке. Ex: 12345 -> 54321

// function reverseNum(num) {
//   let reverseStrNum = num.toString().split("").reverse().join("");
//   return parseInt(reverseStrNum);
// }
// console.log(reverseNum(12345));

// ==========================================================================
// ================= INTERMIDATE =========================
// ex-3

